In [1]:
import pandas as pd
df =pd.read_csv("D:\\AIML\\Term 2\\Advanced Python AI and ML Tools\\Activities\\titanic.csv")

In [2]:
df.shape

(2207, 11)

In [3]:
df.head()

,name,gender,age,class,embarked,country,ticketno,fare,sibsp,parch,survived
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,5547.0,7.11,0.0,0.0,no
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,2673.0,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,2673.0,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,2673.0,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,348125.0,7.13,0.0,0.0,yes

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2207 entries, 0 to 2206
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      2207 non-null   object
 1   gender    2207 non-null   object
 2   age       2205 non-null   float64
 3   class     2207 non-null   object
 4   embarked  2207 non-null   object
 5   country   2126 non-null   object
 6   ticketno  1316 non-null   float64
 7   fare      1291 non-null   float64
 8   sibsp     1307 non-null   float64
 9   parch     1307 non-null   float64
 10  survived  2207 non-null   object
dtypes: float64(5), object(6)
memory usage: 189.8+ KB

In [5]:
df.isnull().mean()*100

name         0.000000
gender       0.000000
age          0.090621
class        0.000000
embarked     0.000000
country      3.670140
ticketno    40.371545
fare        41.504304
sibsp       40.779338
parch       40.779338
survived     0.000000
dtype: float64

In [6]:
df.describe()

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
25%      22.000000  1.426225e+04     7.180600     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
75%      38.000000  3.470770e+05    31.060750     1.000000     0.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [7]:
df.describe(percentiles=[0.01,.1,.2,.3,.4,.5,.6,.7,.8,.9,.99]) # getting more quabtiles

               age      ticketno         fare        sibsp        parch
count  2205.000000  1.316000e+03  1291.000000  1307.000000  1307.000000
mean     30.444444  2.842157e+05    33.404760     0.499617     0.385616
std      12.151764  6.334726e+05    52.227592     1.042273     0.866092
min       0.166667  2.000000e+00     3.030500     0.000000     0.000000
1%        2.000000  7.668500e+02     6.150000     0.000000     0.000000
10%      18.000000  2.668000e+03     7.140800     0.000000     0.000000
20%      21.000000  1.166800e+04     7.170600     0.000000     0.000000
30%      24.000000  1.758100e+04     8.010000     0.000000     0.000000
40%      26.000000  2.840300e+04    11.020800     0.000000     0.000000
50%      29.000000  1.114265e+05    14.090200     0.000000     0.000000
60%      32.000000  2.376680e+05    22.070200     0.000000     0.000000
70%      36.000000  3.309755e+05    27.140500     1.000000     0.000000
80%      40.000000  3.492170e+05    42.080000     1.000000     1.000000
90%      46.000000  3.686375e+05    78.050400     1.000000     2.000000
99%      63.000000  3.101304e+06   262.070600     5.000000     4.000000
max      74.000000  3.101317e+06   512.060700     8.000000     9.000000

In [8]:
df["age"].quantile(0.01) #getting specific quantile

2.0

In [9]:
df.drop(columns="ticketno",axis=1,inplace=True)

In [10]:
df.columns

Index(['name', 'gender', 'age', 'class', 'embarked', 'country', 'fare',
       'sibsp', 'parch', 'survived'],
      dtype='object')

### slicing

In [11]:
df.at[0,"age"]

42.0

In [12]:
df.at[0,["age","class"]] # use to fetch a single value only

TypeError: unhashable type: 'list'

In [13]:
df.iloc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes

In [14]:
df.loc[1:4]

,name,gender,age,class,embarked,country,fare,sibsp,parch,survived
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes

In [15]:
print(df.index.name) #returns None

None

In [21]:
df = df.set_index(df['name'])
df.index.name # updating the index name

'name'

In [22]:
df.loc["Abbott, Mr. Eugene Joseph"] #using named indices

name        Abbott, Mr. Eugene Joseph
gender                           male
age                              13.0
class                             3rd
embarked                            S
country                 United States
fare                            20.05
sibsp                             0.0
parch                             2.0
survived                           no
Name: Abbott, Mr. Eugene Joseph, dtype: object

In [23]:
df.iloc["Abbott, Mr. Eugene Joseph"] # takes the default indices only

TypeError: Cannot index by location index with a non-integer key

In [24]:
df.reset_index(drop=True, inplace=True) #reset the index to defalut(None) value

In [25]:
print(df.index.name)

None

### Filtering

In [33]:
df[df["gender"]=="female"].shape # no of records for females

(489, 10)

In [34]:
female_df = df[df["gender"]=="female"]
female_df.shape

(489, 10)

In [35]:
female_df = df[(df["gender"]=="female") & (df["age"]>50)]
female_df.shape

(36, 10)

In [36]:
male_df = df[(df["gender"]=="male") & (df["age"]>50)]
male_df.shape

(96, 10)

In [39]:
final_df = df[((df["gender"]=="male") & (df["age"]>50))|((df["gender"]=="male") & (df["age"]<20)) ]
final_df.shape

(304, 10)

### Replacing the values

In [41]:
df["gender"].replace(["female","male"],["W","M"]).head(5)

0    M
1    M
2    M
3    W
4    W
Name: gender, dtype: object

In [42]:
df['sex']=df['gender'].replace(["female","male"],[1,0])
df['sex'].value_counts()

sex
0    1718
1     489
Name: count, dtype: int64

In [ ]:
df["survived_id"] = df[""]

### counting null values using value_counts

In [49]:
df["country"].value_counts(dropna=False) # counting null values (NaN  81)

country
England                  1125
United States             264
Ireland                   137
Sweden                    105
NaN                        81
Lebanon                    71
Finland                    54
Scotland                   36
Canada                     34
France                     26
Norway                     26
Belgium                    22
Northern Ireland           21
Wales                      20
Bulgaria                   19
Switzerland                18
Channel Islands            17
Croatia (Modern)           12
Croatia                    11
Italy                      11
Spain                       9
India                       8
Hungary                     7
Denmark                     7
Argentina                   7
South Africa                6
Germany                     6
Turkey                      6
Australia                   5
Slovenia                    4
Bosnia                      4
Poland                      3
Austria                     3
Netherlands                 2
Greece                      2
Siam                        2
Russia                      2
Peru                        2
Uruguay                     2
Syria                       1
China/Hong Kong             1
Japan                       1
Latvia                      1
Yugoslavia                  1
Slovakia (Modern day)       1
Egypt                       1
Cuba                        1
Mexico                      1
Guyana                      1
Name: count, dtype: int64

### Cross Tab

In [50]:
pd.crosstab(df["sex"],df["gender"],margins=True,margins_name="total")

gender  female  male  total
sex
0            0  1718   1718
1          489     0    489
total      489  1718   2207

### Save CrossTab to CSV

In [52]:
crossTab = pd.crosstab( df["survived"],df["gender"],
                       margins=True,margins_name="total")
crossTab.to_csv("D:\\AIML\\Term 2\\Advanced Python AI and ML Tools\\Activities\\crosstab.csv")
crossTab

gender    female  male  total
survived
no           130  1366   1496
yes          359   352    711
total        489  1718   2207

### Rename

In [53]:
df.rename(columns={"class":"passenger_class"},inplace=True)
df.head()

,name,gender,age,passenger_class,embarked,country,fare,sibsp,parch,survived,sex
0,"Abbing, Mr. Anthony",male,42.0,3rd,S,United States,7.11,0.0,0.0,no,0
1,"Abbott, Mr. Eugene Joseph",male,13.0,3rd,S,United States,20.05,0.0,2.0,no,0
2,"Abbott, Mr. Rossmore Edward",male,16.0,3rd,S,United States,20.05,1.0,1.0,no,0
3,"Abbott, Mrs. Rhoda Mary 'Rosa'",female,39.0,3rd,S,England,20.05,1.0,1.0,yes,1
4,"Abelseth, Miss. Karen Marie",female,16.0,3rd,S,Norway,7.13,0.0,0.0,yes,1